import sys
#1. На вход программе поступают две последовательности целых чисел, каждая с новой строки.
# Необходимо прочитать эти последовательности и сохранить в отдельных списках или кортежах.
# Затем, попарно перебрать их элементы и перемножить между собой. При реализации программы используйте функции zip и map.
# Выведите на экран первые три значения, используя функцию next. Значения выводятся в строчку через пробел.
# (Полагается, что три выходных значения всегда будут присутствовать).
# lst1 = list(map(int, input().split()))
# lst2 = list(map(int, input().split()))
# lst3 = list(zip(lst1, lst2))
# res = map(lambda x: x[0]*x[1], lst3)
# print(next(res), next(res), next(res))